PRONOUN_1ST_SINGLE_WORDS = { # speaker|說話者 \ 我們|we
    '余',
    '吾',
    '我',
    '咱',
    '咱家',
    '俺',
    '敝人',
    '唵',
    '昝',
    '乃公',
    '老子',
    '老夫',
    '老朽',
    '老拙',
    '老漢',
    '小道',
    '貧道',
    '下官',
    '臣下',
    '臣僕',
    '微臣',
    '小可',
    '小弟',
    '在下',
    '後學',
    '草民',
    '愚兄',
    '愚弟',
    '鄙人',
    '賤號',
    '駑下',
    '愚',
    '老身',
    '朕',
    '奴家',
    '老衲',
    '寡人',
    '未亡人',
    '妾',
    '老娘',
    '本宮',
    '貧僧',
    '哀家',
}

PRONOUN_1ST_PLURAL_WORDS = { # 我們|we
    '吾人',
    '吾曹',
    '吾等',
    '吾輩',
    '吾儕',
    '我人',
    '我方',
    '我們',
    '我等',
    '我輩',
    '咱們',
    '俺們',
    '你我',
    '我倆',
}

PRONOUN_1ST_WORDS = {
    *PRONOUN_1ST_SINGLE_WORDS,
    *PRONOUN_1ST_PLURAL_WORDS,
}

################################################################################################################################

PRONOUN_2ND_SINGLE_WORDS = { # listener|聽者 \ 你們|you
    '汝',
    '你',
    '臺端',
    '儂',
    '聽者',
    '妳',
    '大官人',
    '大駕',
    '兄臺',
    '台甫',
    '台端',
    '台駕',
    '你老',
    '足下',
    '卿家',
    '座前',
    '您',
    '尊前',
    '尊駕',
    '鈞',
    '鈞座',
    '閣下',
    '執事',
    '庭上',
    '堂上',
    '麾下',
    '大人',
    '敬啟者',
    '您們',
    '卿卿',
    '達令',
    '親愛的',
    '親親',
    '殺千刀的',
}

PRONOUN_2ND_PLURAL_WORDS = { # 你們|you
    '列位',
    '汝曹',
    '汝等',
    '汝輩',
    '你們',
    '你等',
    '若輩',
    '爾等',
    '諸位',
    '諸公',
    '諸君',
    '妳們',
}

PRONOUN_2ND_WORDS = {
    *PRONOUN_2ND_SINGLE_WORDS,
    *PRONOUN_2ND_PLURAL_WORDS,
}

################################################################################################################################

PRONOUN_3RD_SINGLE_WORDS = { # 3rdPerson|他人 \ 他們|they
    '他',
    '她',
    '祂',
    '牠',
    '它',
    '人家',
    '之',
    '他人',
    '伊',
    '別人',
    '旁人',
    '那廝',
    '對方',
}

PRONOUN_3RD_PLURAL_WORDS = { # 他們|they
    '他們',
    '她們',
    '祂們',
    '牠們',
    '它們',
    '彼等',
}

PRONOUN_3RD_WORDS = {
    *PRONOUN_3RD_SINGLE_WORDS,
    *PRONOUN_3RD_PLURAL_WORDS,
}

################################################################################################################################

PRONOUN_WORDS = {
    *PRONOUN_1ST_WORDS,
    *PRONOUN_2ND_WORDS,
    *PRONOUN_3RD_WORDS,
}
